register_product/app/controllers/products_controller.rb

INSERT INTO "products" ("name", "unity", "color", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Bola"], ["unity", "UN"], ["color", "Branco"], ["created_at", "2023-06-07 19:45:39.528709"], ["updated_at", "2023-06-07 19:45:39.528709"]]
---
  def create
    @product = Product.new(product_params)

    if @product.save