stock/app/controllers/items_controller.rb

  def update
    if @item.update(item_params)
---
UPDATE "items" SET "color" = ?, "quantity" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["color", "Preto"], ["quantity", 5], ["updated_at", "2023-06-08 13:33:43.543034"], ["id", 2]]