stock/app/services/create_item.rb

  def self.execute(body)
    begin
      Item.find_or_create_by(
        name: body["name"],
        unity: body["unity"],
        color: body["color"]
      )
---
INSERT INTO "items" ("name", "unity", "color", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Xbox"], ["unity", "UN"], ["color", "branco"], ["quantity", nil], ["created_at", "2023-06-08 13:31:12.639767"], ["updated_at", "2023-06-08 13:31:12.639767"]]
SELECT "items".* FROM "items" WHERE "items"."name" = ? AND "items"."unity" = ? AND "items"."color" = ? LIMIT ?  [["name", "Xbox Series S"], ["unity", "unidade"], ["color", "branco"], ["LIMIT", 1]]